OpenFOAM-4.x-master/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 370;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 370;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 370;
        value           uniform 370;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            fixedMultiPhaseHeatFlux;
        relax           0.5;
        q               uniform 100000;
        phase           "liquid";
        value           uniform 370;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
