OpenFOAM-4.x-master/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/epsilon.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      epsilon.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
0.0419653487
0.0166405358
0.00900207344
0.005683038
0.00380594589
0.00255249533
0.00162012472
0.000886859793
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00015;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 0.00015;
        value           nonuniform List<scalar>
25
(
0.0419977079
0.0166506555
0.00900899996
0.00568925657
0.00381232044
0.00255956051
0.00162847181
0.000896728745
...
)
;
    }
    wall1
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
0.0419653487
0.0419654611
0.0419655923
0.0419657345
0.0419658904
0.0419660621
0.0419662513
0.0419664589
...
)
;
    }
    wall2
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
0.0412932979
0.0412946744
0.0412931691
0.041291993
0.0412907793
0.0412895822
0.0412883945
0.0412872181
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
