OpenFOAM-4.x-master/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/epsilon.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      epsilon.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
0.041965349
0.0166405359
0.00900207363
0.00568303829
0.00380594629
0.00255249587
0.00162012539
0.000886860569
...
)
;

boundaryField
{
    inlet
    {
        type            mapped;
        field       epsilon.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           nonuniform List<scalar>
25
(
0.0419657345
0.0166407085
0.00900229636
0.00568332742
0.00380631734
0.00255296286
0.00162069785
0.00088750996
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 0.00015;
        value           nonuniform List<scalar>
25
(
0.0419977126
0.0166506557
0.00900900019
0.00568925688
0.00381232086
0.00255956104
0.00162847246
0.000896729492
...
)
;
    }
    wall1
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
0.041965349
0.0419654615
0.0419655927
0.041965735
0.0419658909
0.0419660627
0.041966252
0.0419664596
...
)
;
    }
    wall2
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
0.0419627924
0.0419630659
0.0419631668
0.0419633108
0.0419634652
0.0419636361
0.0419638245
0.0419640315
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
