OpenFOAM-4.x-master/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/k.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      k.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
0.00462107176
0.00438626956
0.00374943197
0.00318948512
0.00265007788
0.00210873544
0.00155763819
0.000999380105
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 3.75e-05;
        value           nonuniform List<scalar>
25
(
0.00462344729
0.00438930497
0.00375362531
0.00319491759
0.00265685189
0.00211701852
0.00156771398
0.00101143589
...
)
;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar>
75
(
0.00462107176
0.00462108001
0.00462108965
0.00462110009
0.00462111154
0.00462112415
0.00462113804
0.00462115329
...
)
;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar>
75
(
0.004571605
0.00457170683
0.00457159572
0.00457150893
0.00457141936
0.00457133101
0.00457124337
0.00457115655
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
